Revit 2022 API
Definition Members
The Definition type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDataType
 Gets a ForgeTypeId identifying the data type describing values of the parameter.
GetGroupTypeId
 Returns the identifier of the parameter definition's parameter group.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId |  Obsolete.
 Gets the identifier of the spec describing values of the parameter.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup
 Returns the group ID of the parameter definition.
ParameterType |  Obsolete.
Returns the user visible interpretation of the parameter data.
See Also
Definition Class
Autodesk.Revit.DB Namespace